app/controllers/sessions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."uid" = ? AND "users"."provider" = ? LIMIT 1  [["uid", "17461834"], ["provider", "github"]]
---
  def create
    auth_hash = request.env['omniauth.auth']

    # by default - login failed
    flash[:notice] = "Login failed!"
    return redirect_to root_path unless auth_hash['uid']

    # find the person in the database, if the person is new from the site, build the new user and save the user.
   @user = User.find_by(uid: auth_hash[:uid], provider: auth_hash[:provider])