app/controllers/tasks_controller.rb

  def create
    # @path = "create_path"
    # @method = :post
    # @params = params
    # @mytask = Task.new({name: params[:task][:name], description: params[:task][:description], status: params[:task][:status], completion_date: params[:task][:completion_date]})
    @mytask = Task.new(task_params)
    current_user.tasks << @mytask
---
INSERT INTO "tasks" ("name", "description", "status", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "new task"], ["description", "work"], ["status", "incomplete"], ["user_id", 1], ["created_at", "2016-10-24 21:27:37.517305"], ["updated_at", "2016-10-24 21:27:37.517305"]]

  def update
    # @mytask.update({name: params[:task][:name], description: params[:task][:description], status: params[:task][:status], completion_date: params[:task][:completion_date]})
    if @mytask.update(task_params)
---
UPDATE "tasks" SET "description" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["description", "get the porkchop off the grill"], ["updated_at", "2016-10-02 03:16:53.676241"], ["id", 13]]

  def destroy
    @mytask.destroy
---
DELETE FROM "tasks" WHERE "tasks"."id" = ?  [["id", 6]]

  def complete
    @mytask.status = "complete"
    @mytask.completion_date = Time.now
    @mytask.save
---
UPDATE "tasks" SET "status" = ?, "completion_date" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["status", "complete"], ["completion_date", "2016-09-30 23:26:10.971863"], ["updated_at", "2016-09-30 23:26:10.972343"], ["id", 2]]

  def find_task
    @mytask = Task.find(params[:id].to_i)
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT 1  [["id", nil]]